# Константы

# Инструкция
instr_text_string = '''(1) Как решить уравнение:
    • Нажать на поле ввода (надпись «Введите уравнение...»);
    • Ввести уравнение, используя требования в пункте (2) и (3);
    • Нажать кнопку «Решить уравнение» под полем ввода или клавишу enter.

(2) При вводе уравнения заменить привычные математические действия:
    • Умножения на «*»;
    • Деления на «/»;
    • Возведения в степень на «^».

(3) Уравнение должно быть записано относительно строчной
переменной x (английская буква «x») с приравниванием к 0 или без.

Примеры: 
x ^ 3 + 1 = 0
3 ^ 8 * x ^ 3 + 2 * x ^ 2 + 12 = 0
(-x / 7.6 + 2) * (12 + x) * x ^ 3 - 21 ^ 2 / (3 * x - 4) ^ 21 * 3 ^ 21

Любой текст можно копировать с помощью выделения, а затем нажатия
сочетания клавиш ctrl + c. Копировать можно примеры, найденные корни
последние решения и т.д. Найденные корни можно пролистывать, если
их слишком много. Также, можно включать или выключать
дополнительные звуки.'''

# Ошибка
check_error_find_roots_string = '''Возможно следует дописать уравнение, либо исключить
русские буквы, английские (кроме «x»), спецсимволы (кроме «*», «/», «^» и скобок), пустую строку, ДЕЛЕНИЕ
на 0, повторяющиеся символы и т.д.'''
